---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.ComponentRepeaterSlotFailures
source: html/d143ca29-b2c5-4c5d-e1d5-984fafe9dae1.htm
---
# BuiltInFailures.ComponentRepeaterSlotFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.